---
kind: method
id: M:Autodesk.Revit.DB.Reference.#ctor(Autodesk.Revit.DB.Element)
source: html/fdbf33c3-b84b-7fb1-9949-a7f25d8b3b09.htm
---
# Autodesk.Revit.DB.Reference.#ctor Method

Creates a Reference with the supplied element.

## Syntax (C#)
```csharp
public Reference(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to create a reference.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the parameter is Nothing nullptr a null reference ( Nothing in Visual Basic) .